{
  "media_info": {
    "video_id": "PCtQ6sipdqA",
    "title": "How to Find Time for Everything with a Full Time Job",
    "author": "Ali Abdaal",
    "video_path": null,
    "audio_path": "E:\\Projects\\youtube-video-summarization\\data\\downloads\\1744728829_How to Find Time for Everything with a Full Time J.mp3",
    "transcript_path": "E:\\Projects\\youtube-video-summarization\\data\\transcripts\\1744728829_How to Find Time for Everything with a Full Time J.json"
  },
  "summary": "The speaker, Ali, introduces a three-part video series on managing time outside of a 9-to-5 job, sharing her personal experience as a doctor turned entrepreneur. \nShe emphasizes the importance of developing time management skills to achieve goals and priorities outside of work. \nAli discusses the foundational mindsets and philosophies needed for effective time management, encouraging viewers to appreciate the value of their time. \nShe argues that time management is not about promoting hustle culture or toxic productivity, but about taking control of one's time and making intentional choices. \nThe speaker shares personal anecdotes and stories to illustrate the importance of prioritization and saying no to non-essential tasks. \nShe categorizes activities into \"life maintenance\" and \"progression,\" encouraging listeners to allocate time for activities that promote progress. \nThe speaker discusses two mindsets for effective time management: the mindset of progress and the mindset of intentionality. \nShe emphasizes the importance of being intentional with time, using a 15-minute block approach to make every moment count. \nThe speaker also introduces the idea of \"treating yourself like a robot,\" being kind and non-judgmental towards oneself when mistakes are made. \nThis approach involves identifying problems and tweaking the system to improve, rather than engaging in self-criticism. \nThe speaker encourages viewers to think about what they want to achieve in the next 12 months and to have goals that bring them a sense of purpose and fulfillment. \nThe series aims to help viewers achieve their goals and priorities outside of work, and the next episode will focus on practical tips to minimize time-wasting activities.",
  "transcript_text": " Hey friends, welcome back to the channel. If you're new here, my name is Ali. I'm a doctor turned entrepreneur and the author of Feel Good Productivity, which is about how to do more of what matters to you in a way that's enjoyable, meaningful, and sustainable. And this is the first episode of a three-part series about how to manage your time outside of your nine-to-five job. Now, this is a topic that's really close to my heart because I started this YouTube channel and my business, and basically every good thing in my life has happened as a result of me being able to manage my time outside of the time where I had a nine-to-five job, when I was working full-time as a doctor. And really, this video series is for people who, for example, have a nine to five, whether you're a student or a professional or whatever, and you want to do stuff outside of it, but you maybe struggle to have the time and energy to do the stuff outside of the nine to five. And the stuff might be starting a business or growing a side hustle or like, you know, this sort of thing, but it might not be, it might also be just taking up a hobby or making progress on that language that you're trying to learn, or even just giving more time to your friends and family. And so really in this video series, I want to try and share as many tips as I can so that you can take away some kind of philosophies or mindsets or experiments to run in your own life that can help you achieve more of the things that really matter to you outside of your nine to five. And so in this video, we're going to be talking about the foundational mindsets and philosophies that you need to manage your time appropriately outside of your nine to five. In video two, we're going to be talking about how to not waste your life, all the time drains that get in the way. And then in video number three, we're going to talk about the five skills that you need to master in order to become amazing at time management. Depending on when you're watching this, these videos may well be out. So they'll be linked down in the video description. And I would recommend you watch them in order because, you know, then you get the philosophy before worrying about the tactics. All right. Mindset number one, time management is a really valuable skill to work on. Now, the unfortunate truth is that we are all going to die. And the other unfortunate truth, or maybe fortunate truth, is that time is our single most valuable non-renewable resource. We can always make more money, but we can never make more time. The fact that you're here watching this video, and maybe subscribe to my channel, means that you care enough about this topic, you care about personal development, personal growth, you probably want to make the most of your time outside of your nine to five. But you might be, you know, like I was back in the day, feeling a little overwhelmed with all the stuff that there is to do. And I think sometimes people will dismiss this to be like, well, you know, people who teach about time management, they're just like promoting hustle culture or like toxic productivity or any of that stuff. But this is not about getting you to work harder. This is not about getting you to hustle harder. This is literally about us appreciating that our time is our own to do with as we as we like. and if we tell ourselves the story that we're bad at time management and we haven't like actively worked on the skill of time management, then we fall into the default of like turning on the TV, going on Netflix and just clicking yes on whatever the recommendation has in store for us. We fall into the unintentional default of just going on our phones and habitually picking TikTok or Instagram or YouTube and just sort of scrolling and watching the videos. And the thing that made this hit home for me when I started to get into this productivity, procrastination, time management type stuff, the thing that really made it hit home was that I didn't wanna be in a position where, you know, a few decades from now, I would look back on my life and I would feel like I'd squandered the time and the energy that I had when I was younger. Realistically, I'm probably not gonna remember the TV shows that I watched unless they're absolutely amazing. Game of Thrones, for example. I'm very unlikely to remember the time I spent scrolling YouTube shorts or Instagram or TikTok. But if I use my time intentionally and effectively on the things that I wanted to use it at the time on like the hobbies or friends and family or building my business, whatever the thing might be, I'm far more likely to sort of give a high five to my younger self. And so really the problem we're dealing with here is not a toxic productivity or hustle culture type thing. I'm not telling you, you just have to be more productive. What I'm suggesting is that time is so valuable and so important that spending a little bit of it, learning how to use it better, I think is a skill that all of us could benefit from. Now, as a bit of a side note, one thing that actually helped me be more intentional about my nutrition when I was working a nine to five job and even beyond that is Huel, who are very kindly sponsoring this video. Now, I've been a paying customer of Huel since 2017, since my fifth year of medical school. And that was actually when I first started this YouTube channel as well. And I've been eating Heal fairly regularly since then, because it's a fantastic way to make sure that my nutritional bases are covered when I don't have the time, or I choose not to make the time, to cook a healthy and nutritious meal. Obviously, gold stand would be you cook and eat a healthy meal for every single meal of the day. But in reality, with busy lives, and especially with a hectic work schedule, it can be often hard to make time to do that three times a day. And the nice thing about Heal is that in those moments, instead of eating a totally unhealthy meal from like the work cafeteria, or from like the Starbucks on the way to work, I can instead just eat Heal. And most of their meals have 400 calories, at least 20 grams of protein, 26 vitamins and minerals and nutrients. And so I know that my bases are at least covered. Now, if you've been thinking of starting Heal, you should definitely check out their new bestseller bundle. And this is a bundle of all of their bestselling products. So you can see which one you like best. It includes the Heal Black Edition, which is my personal favorite because it's a higher protein version of Heal. It also includes some instant meals, nutrition bars, and daily A to Z vitamin cans. Yeah, I'm just genuinely a massive fan of Heal. And I think it's amazing for those moments of the day where you don't have the time and to have a proper healthy meal instead. So if you're interested in checking out the bestseller bundle, then do check out the link in the video description. And the bundle also includes a free t-shirt and a shaker, which are both actually really high quality. And with the bundle, you also get a nutrition guide that gives you some advice on your own nutrition and also how to get the most out of Heal. So thank you so much Heal for sponsoring this video and let's get back to it. All right, mindset number two is you can do anything you want, but not everything you want. If you're watching this video and if maybe you follow my channel, then you're probably the sort of person that takes on too much stuff. you're probably quite ambitious. You're probably quite hardworking. You probably want to thrive in your nine to five. You want to do all at work, but maybe you also want to be intentional about your health and relationships and want to level those up There is a phrase there there is a story that is wrongly attributed to Warren Buffett but like I think it directionally legit I don know where this attribution came from but a guy called Alex once asked Warren Buffett at his Omaha conference. Mr. Buffett, I've heard that one of your ways of focusing your energy is that you write down the 25 things you want to achieve, choose the top five, and then avoid the bottom 20. Buffett kind of laughed and said like, that was complete BS. Like he never, he has never said that. Well, I'm actually more curious about how you came up with it because it really isn't, it really isn't the case. It sounds like a very good method of operating, but it's, it's much more disciplined than I actually am. But you know, directionally the advice is still legit. Even if Warren Buffett never actually said the thing, a lot of our priorities, five to 25 end up derailing and taking a lot of time away from the things that truly matter to us. And really we all have the best will in the world when it comes to this. Like, you know, maybe you watch my channel and you're like, oh, it'd be pretty cool to be a YouTuber. I want to start a YouTube channel. And then maybe you're like, oh, you know, I'd love to write online. You know, for me, I was like, I want to get better at the guitar. I don't want to get better at piano. I want to get better at singing. I'd love to be able to play by ear. Oh man, drawing would be really cool. I'd love to learn how to draw. You know what? I'd love to learn Japanese because I like watching anime. And it's just, we keep on adding to the to-do list and we fail to realize that a big part of time management is about prioritization. It's about knowing what you want to say no to so that you have the time, energy, and focus to truly say yes to the things that really matter. And there is a story from my time as a doctor that I always think about. This was when I was in my first week of working in the emergency department. And I walk into the emergency department and I, you know, I take a look in the waiting room and the waiting room is absolutely teeming with patients. There's just so many people. And I'm like, whoa, this is where the real medicine is at. I'm going to save the lives. I go to my computer and I go through the list and then I see the next patient in order of priority. And by the end of the day, I've seen about eight patients because it takes me about an hour. It's like an eight hour shift. And I don't even take my lunch break because I've got the energy, I've got the vibe, I've got the passion, I'm going to save the lives. And on my way home, I look in the waiting room and it's still absolutely teeming with patients. It's still completely full. What the hell? And then on Tuesday, I'm like, all right, cool. It's day two. That was my first day. I was a little bit inefficient. I only saw one patient an hour. Let me be more efficient with this. Let me take two patients at a time. Let me batch my calls to radiology. Let me batch the bloods that I'm doing. Let me sort of parallel process so there's no like downtime and I was applying all of my kind of productivity principles to the seeing of patients and you know again I skipped my lunch break and I saw 12 patients that day I managed to do one and a half patients an hour or 1.2 patients an hour whatever the number is and then on my way home I looked in the waiting room and it was still absolutely teeming with patients it was like nothing I didn't make any difference and then okay the next day I was like what the hell's going on here and I mentioned this to one of the consultants and the consultant said to me, it's your first day, isn't it? I was like, yeah, how do you know? And he was like, yeah, because everyone realizes this a few days to a few weeks in. And what he said really has really stuck with me since. He said, the waiting room will never be empty. There will always be more patients to see. All we can do is show up each day as our best selves and see patients in order of priority. He also forced me to take my lunch break because it's like legally mandated that every four hours you have to take a lunch break because otherwise your focus and concentration falls. And so I actually started taking my lunch breaks. But that has really stuck with me because whatever you're doing with your job, whatever you're doing outside your job, whatever you're doing with your family, there is always more you could be doing. You know, I've heard from parents, it's like, you know, you think you're doing well at work, and then you get home. And it's like, you know, the school is saying you've got to bake a cake for the frickin bake sale, you've got to do your parent teacher meeting, you've got to do this and that you've got to sign up to be a governor of the board. And if you're an entrepreneur, you know, I've got a business, you might have a side hustle. You know, there is always an infinite amount of work to be done, the waiting room will never be empty. But as long as we can show up each day as our best selves, and crucially, focus on things in order of priority, then in a way, it doesn't matter if the waiting room is always full, because as long as you are seeing the highest priority patients first, this is how a surgeon on the battlefield triage patients. If someone's about to die, you see them first. If someone's, you know, got a bit of a cough, you see them second, and then you reprioritize. I think of my entire to-do list and time management and like everything I'm trying to do with that metaphor. The waiting room will never be empty. Therefore, what I choose to do is just show up as my best self every day and focus on things in order of priority. And if we can just do that every day, forever, then we're not going to be filled with regret that like we made the wrong decisions early on in our lives. Oh, by the way, quick thing. We've done some polling of the audience that watches this channel and listens to my podcast and stuff. And one thing that people seem to continuously struggle with is focus. And that is why I've prepared for you a completely free focus crash course, which is seven days of emails where I break down all of the most effective science and practical tips on how to actually focus better. And you can get that completely for free at focuscrashcourse.com. All right. Mindset number three is that life maintenance is not the goal. There are broadly two buckets of things that we can do with our time. There are things that we have to do to maintain the status quo, to maintain our lives. And then there are things that we can do to progress our lives. And progress can be anything. It could be in work, could be side hustle, could be like taking up a new hobby, learning a skill, you know, that kind of stuff. Actively improving a relationship, actively improving our health rather than just maintaining. And when you have a nine to five, when you're working full time, it can be very easy for all of the stuff that you do outside of your nine to five to be in the life maintenance camp. So for example, sleeping eight hours a night, you know, that's at the life maintenance camp, unfortunately, we kind of have to do it, but it not really progressing us in any meaningful way It is maintaining the status quo Similarly cooking and eating food is in the category of life maintenance It just you know you have to eat Unless you like actively trying to improve your cooking skills and experimenting with new recipes and stuff, you know, then that would fall in the progression camp. But just cooking and eating and cleaning up is in the maintenance camp. Cleaning the house, unfortunately, is in the maintenance camp. There are all sorts of these activities that we need to do in the life maintenance camp. And what it can be really easy to do, especially if you're overwhelmed with stuff at work and stuff at home, is for everything we do to either be going to work or to be maintaining our life and maintaining the ability to then go to work the next day. Now, obviously in certain seasons of our life, we're gonna be more imbalanced where it's gonna be a bit of a struggle just to get by. A lot of people were like this in the pandemic. I hear that when you have kids, it becomes like that for a few years. But generally the way I like to think about this is that I wanna make sure that every day I'm spending at least one or two hours doing stuff that is progressing my life outside of work, not just maintaining it. So this might involve, for example, blocking out time specifically to work on specific projects. This might involve setting goals for the year or setting goals for the quarter and then actively making time to work towards those goals. This might involve thinking of my gym stuff rather than I just wanna exercise because exercise is required for life maintenance. Instead of thinking about it as I wanna train, I wanna train for a specific thing. I wanna get my bench press to a hundred kg or my deadlift or like 180 or like I wanna train for that marathon. This sense of progress is a big part of what makes life feel fulfilling and meaningful. And a big part of when people feel like they're in a rut is because they go to work, they come home, they maintain, and then they go to work the next day. So what I would encourage you to do if you haven't yet is, tangibly, practically speaking, set some goals for the year. Now, lots of you attended my annual planning workshop that I hosted a couple of weeks ago, planning to do more of these. But if you have not yet set goals for the year, honestly, what I would recommend is you pause the video right now and have a think 12 months from now, what would you like to be celebrating? What would you like to be celebrating? You know, when I do talks and stuff, I ask people to close their eyes, I play some soulful music in the background, Tony Robbins style, it's great, I love the shit. But what would you like to be celebrating 12 months from now in work, in health, and in relationships? Those are like the three broad buckets of life. You could add more to this if you want. We tend to want to celebrate the wins. We wanna celebrate some kind of progress. So what kind of progress could you make in work, health, and relationships that you can imagine yourself celebrating with a friend 12 months from now? And then once you've thought about that, It is worth writing it down somewhere. You can see it regularly. So for me, I have a Google doc, which is the first thing on my Chrome. I call it my goalkeeper doc because it's where I keep my goals and where I do my weekly reviews, more on that in part three. But that is something that I look at at least once a week and it reminds me what my goals are. And it helps me get into this mode of thinking, oh yeah, I do have a sense of progress. I do have a sense of momentum. And there's a really nice phrase, which is that it's not about the pursuit of happiness. It's about the happiness of pursuit. A lot of using our time well and managing our time is having something to actually work towards outside of our nine to five that helps us feel the sense of purpose. It gives us a reason to be better at time management. It gives us a reason to not procrastinate so much. It gives us a reason to prioritize and set goals and work towards them while enjoying the journey along the way. Because that sense of, I'm on a journey, I'm climbing the summit. There is something I'm working towards is profoundly energizing and it's profoundly fulfilling, even outside of work. All right, mindset number four is the mindset of intentionality. In the world of meditation, I think in like monasteries and stuff, they have a bell, a ding that goes off every now and then. And the point of the ding is to remind the monks or the people in the monastery or whatever to focus on the present moment. You know, one way to think about time management is, especially if you're in the confines of a full-time job, one way to think about it is, to what extent am I being intentional with the way I'm using my time? because when you get good at time management, you'll end up with basically 100% intentionality. So for example, if you imagine this bell were to go off every 15 minutes, and when a bell goes off, the ding happens, and you ask yourself, to what extent were the last 15 minutes intentional or not? That gives you a sense of, am I using my time intentionally, or am I not using my time intentionally? Now, let's say you intended to, for example, cook and eat food. Ding, the bell goes off, great, fantastic, you've cooked and eaten food. But let's say the bell goes off, and in the last 15 minutes, you've been scrolling TikTok or Instagram watching Netflix and you didn't actively make that intention to do those things, now you have not been intentional with your use of time. That's not to say it's a bad thing, that's not to say you should beat yourself up, but the point of time management and getting good at this stuff is that we want to get it to a point that every 15 minute block of time that we have in our calendars and in our lives is at least intentional. Now again, this does not have to be doing work, this does not have to be doing things that are productive, it just needs to be things that are intentional. Did you intend to scroll TikTok for 15 minutes? If so, great. If not, then that's something we can work on. Did you intend to watch that Netflix show and another episode and another episode and another episode? If so, fantastic. You're literally living the dream. But if not, now we've been a bit unintentional with how we've been using our time. And I like intentionality as the bar. You know, sometimes people will say to me in podcasts and stuff, you know, are there any times where you're not productive? And for me, like productivity is basically the same as intentionality. It's like, if I'm using my time well, I consider that being productive. So if I intended to watch four episodes of House of the Dragon, I consider that productive. But if I have found myself watching four episodes of House of the Dragon having not intended to I would consider that unproductive And really the goal of time management is you know firstly to have the sense of progress of things that we actively doing but then secondly to intentionally use the blocks of time that we have And the way I think about it is that each of these blocks of time is 15 minutes. I think 15 minutes is a good amount. You could think of it as hours, but an hour is a bit too long. I think, you know, thinking of it as like there are four of these blocks of time every hour, and every hour I have a choice of what I can do with these 15 minutes. 15 minutes is a lot of time. It's a lot of time to make progress on making a YouTube video, a lot of time to make progress on writing a book. 15 minutes to connect with your spouse or your loved one with your entire presence is actually quite a lot of time. Like from what I've read and what I've experienced, most romantic partners care a lot less about the quantity of time that you spend together. And it's a lot more about the quality of time. And so really 15 minutes is a solid block of time. 15 minutes is enough time to make progress on meaningful projects and also to make progress on improving the health of our most important relationships. And mindset number five is treat yourself like a robot. Now, what I mean by this is that if, for example, you were programming a robot and it didn't do what you intended it to do, you wouldn't like flagellate the robot. You wouldn't like beat it up. You wouldn't like tell the robot it's a terrible person. You would just think, oh, okay, the code didn't work. You know, I programmed the system wrong. And when it comes to time management, focus, distraction, productivity, a lot of procrastination, a lot of this stuff, we tend to have a lot of negative energy towards ourselves about it. Like, oh man, I'm such a fricking idiot. I didn't go to the gym three times this week. Oh, why do I always do, why do I always procrastinate? Like it would be so counterproductive to say that kind of stuff to a robot if we thought it was a robot because it's just the system that hasn't worked. And so if we can treat ourselves like a robot in like a nice way, it means that when we struggle with something or when we fail to be intentional with how we're managing our time or procrastinating or getting distracted or whatever, it means the solution to the problem is we just need to tweak the system rather than I need to beat myself up. Now I'm saying all of this with the risk that, I sometimes get comments being like, oh my God, Ali Abdaal is such a productivity robot. It's like, you know what? I'll take it. If being a productivity robot means I don't beat myself up for failing to do the things that I intended to do, then that's a trade I'll take any day of the week. But I guess practically speaking, an example is, so when I was working as a doctor, when I had a real job, when I had my nine to five confining me with an hour commute to work, an hour commute back, having to like cook for myself or whatever, I wanted to build this YouTube channel. I wanted to film one or two videos a week and edit them and publish them. This was back when I was doing my own editing. And there were certain days where I would get home from work and I would feel completely drained and I would not have the energy to actually edit the videos. Now, in that context, I could have just decided to push through it. I could have beaten myself up. I could have told myself I'm an idiot and I just need to be more disciplined, just need to work harder, all that. I could have had all of those narratives. But instead what I did is I would treat myself like a system. I would be like, okay, the robot did not have enough energy in the tank to do video editing this evening. Great, that's useful to know. Why did the robot not have the energy? Well, okay, well, robot only got four hours of sleep last night because robot was on a night shift the night before. Is that, okay, cool. That's useful to know. Why else? Well, robot didn't really eat anything today or day because it was like a stupidly busy day on like the obstetrics and gynecology ward with all these emergencies. I was like, okay, cool. Emergencies happened and I didn't have time to take care of myself. Nice. Therefore, what can that tell me about next time? So next time around, let me make sure I don't time block an editing session for myself after a night shift because it's very hard to have the energy after a night shift, but I don't have much sleep. And secondly, let me make sure, you know, there is always five minutes to take a lunch break. There's always five minutes to just grab a little sandwich, grab something rather than just starving myself all day. Cool. Now I've got like a new set of algorithms, which is number one, no editing after a night shift. And number two, eat every day for lunch. It's not that hot. I've treated myself like a system. And yet I know so many people who are in identical situations or analogous situations where they won't take that step back to think, why did this happen? They will just see, oh, this thing happened. I failed. I failed to do this thing. Therefore I'm bad. Therefore I'm lazy. Therefore I'm a procrastinator. And it gets into this like personal flagellation. But if you just think, think of yourself as a system, you just identify and diagnose what, what were the problems with that system today? Cool. What does that mean about what you should do moving forward? Great. Hunky-dory life is all good. Okay. So we've talked about these five mindset shifts, but if there's just one thing that you takeaway from this video, I would love for that to be actually having some goals outside of your work, some personal goals to work towards, because there's no point in time management if it's just going to result in us watching, I don't know, watching more Netflix or just maintaining our life a little bit better. I think it's really important to have those things that we're working towards. Have a think about this 12-month celebration, and then in videos two and three of this series, we're going to be talking much more about practical things that you can do, but it's almost like, you know, that Simon Sinek book, Start With Why. If you don't have a why behind why you wanna be more productive or why you wanna manage your time better, then it's just not gonna happen, right? We need to have a clear why. We need to have a set of goals that we're working towards just outside of our work so that we're not just spending our life maintaining the ability to do our nine to five, but instead we're actually making meaningful progress in the pursuit of something that is meaningful to us. It does not have to be a business. It does not have to be a YouTube channel, but it can be if you want. That's what I did. That's why I'm here. It can be whatever you want, but it should be something outside of just life maintenance. That's what I would say. So this was episode one of our three part series around managing your time outside of a nine to five. Check out this video here for episode number two, which is all about the practical things we can do to minimize the amount of time we're wasting or draining away from the things that drain our time. So I hope you enjoy this video and I'll hopefully see you in the next one.",
  "transcript_segments": null,
  "created_at": "2025-04-15 20:55:15"
}